bench/trimbench/res.xfs.nodiscard.samsung980pro.linux65.amd2/o.test.out
nohup: ignoring input
Create /data/m/f.1 at Tue Jun 18 11:15:19 PM UTC 2024
524288+0 records in
524288+0 records out
549755813888 bytes (550 GB, 512 GiB) copied, 2692.09 s, 204 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 512G Jun 19 00:00 /data/m/f.1
Sleep for 30 seconds after creating /data/m/f.1 at Wed Jun 19 12:00:11 AM UTC 2024
Existing /data/m/f.2 is large enough
List kernel
Linux amd2 6.5.0-35-generic #35~22.04.1-Ubuntu SMP PREEMPT_DYNAMIC Tue May  7 09:00:52 UTC 2 x86_64 x86_64 x86_64 GNU/Linux
List mount options for filesystems
sysfs on /sys type sysfs (rw,nosuid,nodev,noexec,relatime)
proc on /proc type proc (rw,nosuid,nodev,noexec,relatime)
udev on /dev type devtmpfs (rw,nosuid,relatime,size=7817932k,nr_inodes=1954483,mode=755,inode64)
devpts on /dev/pts type devpts (rw,nosuid,noexec,relatime,gid=5,mode=620,ptmxmode=000)
tmpfs on /run type tmpfs (rw,nosuid,nodev,noexec,relatime,size=1576708k,mode=755,inode64)
efivarfs on /sys/firmware/efi/efivars type efivarfs (rw,nosuid,nodev,noexec,relatime)
/dev/sda2 on / type ext4 (rw,relatime)
securityfs on /sys/kernel/security type securityfs (rw,nosuid,nodev,noexec,relatime)
tmpfs on /dev/shm type tmpfs (rw,nosuid,nodev,inode64)
tmpfs on /run/lock type tmpfs (rw,nosuid,nodev,noexec,relatime,size=5120k,inode64)
cgroup2 on /sys/fs/cgroup type cgroup2 (rw,nosuid,nodev,noexec,relatime,nsdelegate,memory_recursiveprot)
pstore on /sys/fs/pstore type pstore (rw,nosuid,nodev,noexec,relatime)
bpf on /sys/fs/bpf type bpf (rw,nosuid,nodev,noexec,relatime,mode=700)
systemd-1 on /proc/sys/fs/binfmt_misc type autofs (rw,relatime,fd=29,pgrp=1,timeout=0,minproto=5,maxproto=5,direct,pipe_ino=15920)
hugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,pagesize=2M)
mqueue on /dev/mqueue type mqueue (rw,nosuid,nodev,noexec,relatime)
debugfs on /sys/kernel/debug type debugfs (rw,nosuid,nodev,noexec,relatime)
tracefs on /sys/kernel/tracing type tracefs (rw,nosuid,nodev,noexec,relatime)
fusectl on /sys/fs/fuse/connections type fusectl (rw,nosuid,nodev,noexec,relatime)
configfs on /sys/kernel/config type configfs (rw,nosuid,nodev,noexec,relatime)
ramfs on /run/credentials/systemd-sysusers.service type ramfs (ro,nosuid,nodev,noexec,relatime,mode=700)
/var/lib/snapd/snaps/core20_2264.snap on /snap/core20/2264 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/core20_2318.snap on /snap/core20/2318 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_27948.snap on /snap/lxd/27948 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_28373.snap on /snap/lxd/28373 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21465.snap on /snap/snapd/21465 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21759.snap on /snap/snapd/21759 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/dev/sda1 on /boot/efi type vfat (rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=iso8859-1,shortname=mixed,errors=remount-ro)
binfmt_misc on /proc/sys/fs/binfmt_misc type binfmt_misc (rw,nosuid,nodev,noexec,relatime)
tmpfs on /run/snapd/ns type tmpfs (rw,nosuid,nodev,noexec,relatime,size=1576708k,mode=755,inode64)
nsfs on /run/snapd/ns/lxd.mnt type nsfs (rw)
tmpfs on /run/user/1000 type tmpfs (rw,nosuid,nodev,relatime,size=1576704k,nr_inodes=394176,mode=700,uid=1000,gid=1000,inode64)
/dev/nvme0n1 on /data type xfs (rw,noatime,nodiratime,attr2,inode64,logbufs=8,logbsize=32k,noquota)

Remove /data/m/f.1 at Wed Jun 19 12:00:42 AM UTC 2024
Start fio to read from /data/m/f.2 at Wed Jun 19 12:00:42 AM UTC 2024

iops-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

iops-test-job: (groupid=0, jobs=1): err= 0: pid=2520: Wed Jun 19 00:02:13 2024
  read: IOPS=96.6k, BW=377MiB/s (396MB/s)(33.2GiB/90001msec)
    slat (nsec): min=3236, max=85680, avg=4442.29, stdev=1620.17
    clat (usec): min=15, max=12689, avg=77.35, stdev=70.94
     lat (usec): min=22, max=12694, avg=81.93, stdev=71.03
    clat percentiles (usec):
     |  1.00th=[   59],  5.00th=[   61], 10.00th=[   62], 20.00th=[   64],
     | 30.00th=[   67], 40.00th=[   69], 50.00th=[   72], 60.00th=[   75],
     | 70.00th=[   78], 80.00th=[   81], 90.00th=[   87], 95.00th=[   96],
     | 99.00th=[  130], 99.50th=[  200], 99.90th=[ 1287], 99.95th=[ 1401],
     | 99.99th=[ 1500]
   bw (  KiB/s): min=106056, max=421592, per=100.00%, avg=386628.25, stdev=77688.04, samples=179
   iops        : min=26514, max=105398, avg=96657.12, stdev=19422.03, samples=179
  lat (usec)   : 20=0.01%, 50=0.13%, 100=95.82%, 250=3.62%, 500=0.06%
  lat (usec)   : 750=0.03%, 1000=0.08%
  lat (msec)   : 2=0.26%, 10=0.01%, 20=0.01%
  cpu          : usr=17.79%, sys=53.82%, ctx=2223256, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8696878,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=377MiB/s (396MB/s), 377MiB/s-377MiB/s (396MB/s-396MB/s), io=33.2GiB (35.6GB), run=90001-90001msec

Disk stats (read/write):
  nvme0n1: ios=8686219/11, merge=0/5, ticks=609094/13, in_queue=609111, util=99.95%

run.sh: line 61: kill: (2508) - No such process